In [1]:
import numpy as np
import pandas as pd

对整列缺失值进行填充

In [2]:
S_01_01 = pd.Series(["2005-01-01", "2005-01-02",  
                     "2005-01-03", "2005-01-04"])
S_02_01 = pd.Series([1000, 1500, 800, 1200])
S_03_01 = pd.Series(["孙哥", "黄哥", "翘兔", "sed老师"])
S_04_01 = pd.Series(["杭州", "上海", "上海", "成都"])
S_05_01 = pd.Series([np.nan, np.nan, np.nan, np.nan])
DF1 = pd.DataFrame({"日期": S_01_01, "销售额": S_02_01, 
                    "销售人员": S_03_01, "地址": S_04_01,
                    "国家": S_05_01,})
New_Index_01 = ["001", "002", "003", "004"]
DF1.index = New_Index_01

DF1

             日期   销售额   销售人员  地址  国家
001  2005-01-01  1000     孙哥  杭州 NaN
002  2005-01-02  1500     黄哥  上海 NaN
003  2005-01-03   800     翘兔  上海 NaN
004  2005-01-04  1200  sed老师  成都 NaN

In [3]:
DF1["国家"] = "中国"
DF1

             日期   销售额   销售人员  地址  国家
001  2005-01-01  1000     孙哥  杭州  中国
002  2005-01-02  1500     黄哥  上海  中国
003  2005-01-03   800     翘兔  上海  中国
004  2005-01-04  1200  sed老师  成都  中国

对某个缺失值进行填充

In [4]:
S_01_02 = pd.Series(["2005-01-01", "2005-01-02",  
                     "2005-01-03", "2005-01-04"])
S_02_02 = pd.Series([1000, 1500, np.nan, 1200])
S_03_02 = pd.Series(["孙哥", "黄哥", "翘兔", "sed老师"])
S_04_02 = pd.Series(["杭州", "上海", "上海", "成都"])
DF2 = pd.DataFrame({"日期": S_01_02, "销售额": S_02_02, 
                    "销售人员": S_03_02, "地址": S_04_02,})
New_Index_2 = ["001", "002", "003", "004"]
DF2.index = New_Index_2

DF2

             日期     销售额   销售人员  地址
001  2005-01-01  1000.0     孙哥  杭州
002  2005-01-02  1500.0     黄哥  上海
003  2005-01-03     NaN     翘兔  上海
004  2005-01-04  1200.0  sed老师  成都

In [5]:
DF2.loc["003", "销售额"] = 800
DF2

             日期     销售额   销售人员  地址
001  2005-01-01  1000.0     孙哥  杭州
002  2005-01-02  1500.0     黄哥  上海
003  2005-01-03   800.0     翘兔  上海
004  2005-01-04  1200.0  sed老师  成都

对某个缺失值进行填充

In [6]:
S_01_03 = pd.Series(["2005-01-01", "2005-01-02",  
                     np.nan, np.nan])
S_02_03 = pd.Series([1000, 1500, 800, 1200])
S_03_03 = pd.Series(["孙哥", "黄哥", "翘兔", "sed老师"])
S_04_03 = pd.Series(["杭州", "上海", "上海", "成都"])
DF3 = pd.DataFrame({"日期": S_01_03, "销售额": S_02_03, 
                    "销售人员": S_03_03, "地址": S_04_03,})
New_Index_3 = ["001", "002", "003", "004"]
DF3.index = New_Index_3

DF3

             日期   销售额   销售人员  地址
001  2005-01-01  1000     孙哥  杭州
002  2005-01-02  1500     黄哥  上海
003         NaN   800     翘兔  上海
004         NaN  1200  sed老师  成都

In [7]:
DF3.loc["003": "004", "日期"] = "2005-01-03"
DF3

             日期   销售额   销售人员  地址
001  2005-01-01  1000     孙哥  杭州
002  2005-01-02  1500     黄哥  上海
003  2005-01-03   800     翘兔  上海
004  2005-01-03  1200  sed老师  成都

自动找到缺失值进行填充

In [8]:
S_01_04 = pd.Series([1.0, 2.0, np.nan, 4.0])
S_02_04 = pd.Series([5.0, np.nan, 7.0, np.nan])
S_03_04 = pd.Series([8, 9, 10, 11])
DF4 = pd.DataFrame({"A": S_01_04 , "B": S_02_04 , 
                    "C": S_03_04})
DF4

     A    B   C
0  1.0  5.0   8
1  2.0  NaN   9
2  NaN  7.0  10
3  4.0  NaN  11

In [9]:
# 将 A 列中的空白部分填写为 0 
DF4["B"].fillna(0)

0    5.0
1    0.0
2    7.0
3    0.0
Name: B, dtype: float64

In [10]:
# 将 A 列中的空白部分填写为平均值
DF4["B"].fillna(DF4["B"].mean())

0    5.0
1    6.0
2    7.0
3    6.0
Name: B, dtype: float64

In [11]:
DF4.fillna(0)

     A    B   C
0  1.0  5.0   8
1  2.0  0.0   9
2  0.0  7.0  10
3  4.0  0.0  11

In [12]:
DF4.fillna({'A': 0, 'B': 10, 'C': 20})

     A     B   C
0  1.0   5.0   8
1  2.0  10.0   9
2  0.0   7.0  10
3  4.0  10.0  11

如果想改变原始列  
`DF4 = DF4.fillna(0)`  
`DF4.fillna(0, inplace = True)`

删除存在缺失值的行

In [13]:
S_01_05 = pd.Series(["孙哥", "黄哥", "翘兔", "sed老师"])
S_02_05 = pd.Series([25.0, 30.0, np.nan, 40])
S_03_05 = pd.Series([50000.0, np.nan, 70000.0, 60000.0])
S_04_05 = pd.Series(["M", "F", "M", "F"])
DF5 = pd.DataFrame({"姓名": S_01_05 , "年龄": S_02_05 , 
                    "工资": S_03_05 , "性别": S_04_05})
DF5

      姓名    年龄       工资 性别
0     孙哥  25.0  50000.0  M
1     黄哥  30.0      NaN  F
2     翘兔   NaN  70000.0  M
3  sed老师  40.0  60000.0  F

In [14]:
DF5.dropna()

      姓名    年龄       工资 性别
0     孙哥  25.0  50000.0  M
3  sed老师  40.0  60000.0  F

In [15]:
DF5.dropna(subset = ["工资"])

      姓名    年龄       工资 性别
0     孙哥  25.0  50000.0  M
2     翘兔   NaN  70000.0  M
3  sed老师  40.0  60000.0  F

In [16]:
DF5.dropna(axis = 1)

      姓名 性别
0     孙哥  M
1     黄哥  F
2     翘兔  M
3  sed老师  F

如果想改变原来表中的数据：  
`DF5 = DF5.dropna(subset = ["工资"])`  
`DF5.dropna(subset = ["工资"],inplace = True`

删除重复数据

In [17]:
S_01_06 = pd.Series(["孙哥", "黄哥", "翘兔", "黄哥", "sed老师"])
S_02_06 = pd.Series([25, 30, 35, 30, 40]) 
S_03_06 = pd.Series(["M", "F", "M", "F", "M"])
DF6 = pd.DataFrame({"姓名": S_01_06 , "年龄": S_02_06, 
                    "性别": S_03_06})
DF6

      姓名  年龄 性别
0     孙哥  25  M
1     黄哥  30  F
2     翘兔  35  M
3     黄哥  30  F
4  sed老师  40  M

In [18]:
DF6["姓名"].drop_duplicates()

0       孙哥
1       黄哥
2       翘兔
4    sed老师
Name: 姓名, dtype: object

In [19]:
DF6.drop_duplicates()

      姓名  年龄 性别
0     孙哥  25  M
1     黄哥  30  F
2     翘兔  35  M
4  sed老师  40  M

In [20]:
DF6.drop_duplicates(subset = ["姓名", "性别"])

      姓名  年龄 性别
0     孙哥  25  M
1     黄哥  30  F
2     翘兔  35  M
4  sed老师  40  M

In [21]:
DF6["姓名"].drop_duplicates(keep = "last")

0       孙哥
2       翘兔
3       黄哥
4    sed老师
Name: 姓名, dtype: object

如果要改变原始`DataFrame`  
`DF6 = DF6.drop_duplicates()`<br>
`DF6.drop_duplicates(inplace = True)`

对值进行替换

In [22]:
S_01_07 = pd.Series(["孙哥", "黄哥", "翘兔", "sed老师"])
S_02_07 = pd.Series(["杭州", "上海", "上海", "成都"])
S_03_07 = pd.Series(["树人大学", "3484学院", "瞧尔萨斯学院", "3484"])
DF7 = pd.DataFrame({"姓名": S_01_07, "家乡": S_02_07, 
                    "学校": S_03_07})
DF7

      姓名  家乡      学校
0     孙哥  杭州    树人大学
1     黄哥  上海  3484学院
2     翘兔  上海  瞧尔萨斯学院
3  sed老师  成都    3484

In [23]:
DF7["学校"].replace("3484", "3484学院")

0      树人大学
1    3484学院
2    瞧尔萨斯学院
3    3484学院
Name: 学校, dtype: object

In [24]:
DF7.replace("3484", "3484学院")

      姓名  家乡      学校
0     孙哥  杭州    树人大学
1     黄哥  上海  3484学院
2     翘兔  上海  瞧尔萨斯学院
3  sed老师  成都  3484学院

In [25]:
DF7.replace(["3484", "智力有问题的一群小人", "3484 College"], "3484学院")

      姓名  家乡      学校
0     孙哥  杭州    树人大学
1     黄哥  上海  3484学院
2     翘兔  上海  瞧尔萨斯学院
3  sed老师  成都  3484学院

In [26]:
replace_dict = {'铁炉堡': '铁炉堡小区',
                '3484': '3484学院',
                '瞧尔萨斯': '瞧尔萨斯精神病院',
                '弱智': '一群小人'}
DF7.replace(replace_dict)

      姓名  家乡      学校
0     孙哥  杭州    树人大学
1     黄哥  上海  3484学院
2     翘兔  上海  瞧尔萨斯学院
3  sed老师  成都  3484学院

如果要改变原有`DataFrame`  
`DF7 = DF7.replace("3484", "3484学院")`  
`DF7.replace("3484", "3484学院", inplace = True)`

对值的类型进行转换<br>
转换成整数: `S1.astype(int)`<br>
转换成字符串: `S1.astype(str)`<br>
转换成浮点数: `S1.astype(float)`<br>
转换成布尔值: `S1.astype(bool)`<br>
...
   比如int、 float、 str、 bool等

In [27]:
type("3")

str

In [28]:
type(3)

int

In [29]:
type(3.0)

float

In [30]:
type([1, 2])

list

In [31]:
type(True)

bool

In [32]:
type("[1, 2]")

str

In [33]:
KKK = "[1, 2]"
type(KKK)

str

In [34]:
S1 = pd.Series(["飞机", "手榴弹", "冰箱", "树枝"])
S1.astype("category")

0     飞机
1    手榴弹
2     冰箱
3     树枝
dtype: category
Categories (4, object): ['冰箱', '手榴弹', '树枝', '飞机']